{"class_name": "Functional", "config": {"name": "model_4", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_4"}, "name": "input_4", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "image_dense", "trainable": true, "dtype": "float32", "units": 4096, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "image_dense", "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "image_reshape", "trainable": true, "dtype": "float32", "target_shape": [16, 16, 16]}, "name": "image_reshape", "inbound_nodes": [[["image_dense", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "idecode_conv1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "idecode_conv1", "inbound_nodes": [[["image_reshape", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "idecode_norm1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "idecode_norm1", "inbound_nodes": [[["idecode_conv1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "idecode_relu1", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "idecode_relu1", "inbound_nodes": [[["idecode_norm1", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "idecode_conv2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "idecode_conv2", "inbound_nodes": [[["idecode_relu1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "tdecode_dense1", "trainable": true, "dtype": "float32", "units": 16, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "tdecode_dense1", "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "idecode_norm2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "idecode_norm2", "inbound_nodes": [[["idecode_conv2", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "text_reshape", "trainable": true, "dtype": "float32", "target_shape": [16]}, "name": "text_reshape", "inbound_nodes": [[["tdecode_dense1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "idecode_relu2", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "idecode_relu2", "inbound_nodes": [[["idecode_norm2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "tdecode_dense2", "trainable": true, "dtype": "float32", "units": 32, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "tdecode_dense2", "inbound_nodes": [[["text_reshape", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "image_output_layer", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "image_output_layer", "inbound_nodes": [[["idecode_relu2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "text_output_layer", "trainable": true, "dtype": "float32", "units": 13, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "text_output_layer", "inbound_nodes": [[["tdecode_dense2", 0, 0, {}]]]}], "input_layers": [["input_4", 0, 0]], "output_layers": [["image_output_layer", 0, 0], ["text_output_layer", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}